rainer20512/stm32-fw/stm32l4/Src/system/clockconfig.c
/**
  ******************************************************************************
  * @file    clockconfig.c
  * @author  Rainer
  * @brief   Several Clock Configurations with different sources, SYSCLK 
  *          frequencies and correct Vcore settings and NVM Wait states
  *
  *          Available configurations
  *          1a. MSI-Clock based with parameterized clk value between 100kHz
  *              and 24 MHz,                Vcore Range 2, 0-3 WS
  *          1b. MSI-Clock based with parameterized clk value between 100kHz
  *              and 48 MHz,                Vcore Range 1, 0-2 WS
  *          2.  HSE Bypass mode, 8MHz,     Range 2, 0 WS
  *              ( this is specially for Nucleo-Boards ) 
  *          3a. HSI based, 16MHz,          Range 2, 1 WS
  *          3b. HSI based, 16MHz,          Range 1, 0 WS
  *          4.  PLL/HSI based, 32-80 MHz,  Range 1, 1-4 WS
  *         
  * @note    In every configuration there are only identical clock values for
  *          all types of sore clocks ( SYSCLK, HCLK, APB1 and APB2 CLK ) 
  *
  ******************************************************************************
  * Coarse Performance estimation
  * MSI  2MHZ Clocks, Scale 3, 0WS :  63700 Increments per second
  * MSI  4MHZ Clocks, Scale 3, 0WS : 129200 Increments per second
  * HSE  8MHZ Clocks, Scale 2, 0WS : 248100 Increments per second
  * HSI 16MHZ Clocks, Scale 2, 1WS : 430300 Increments per second
  * HSI 16MHZ Clocks, Scale 1, 0WS : 498000 Increments per second
  * PLL 32MHZ Clocks, Scale 1, 0WS : 862200 Increments per second
  ******************************************************************************
  */


/** @addtogroup CLOCK_CONFIG
  * @{
  */

#include "config/config.h"

#include "stm32l4xx_hal.h"
#include "dev/devices.h"
#include "eeprom.h"
#include "system/pll.h"
#include "config/pll_config.h"
#include "system/clockconfig.h"
#include "system/timer_handler.h"

#if DEBUG_MODE > 0
    #include "debug_helper.h"
#endif

#if DEBUG_PROFILING > 0
    #include "system/profiling.h"
#endif

/*
 *************************************************************************************
 * As in Stop2 mode the wakeup clock is either MSI or HSI, we have to safe 
 * all neccessary parameters to be able to restore the clock settings when
 * normal clock source is not HSI16 or MSI.
 * When normal clock source is HSI16 or MSI, the same clock is selected as wakeup
 * clock source and we can continue as before sleep without any reconfiguration
 * All the following variables are set in "System_Clock_Set"
 *************************************************************************************/

static uint32_t saved_mhz;                 /* The last selected PLL frequency        */
static bool saved_bSwitchOffMSI;           /* the last selected bSwitchOffMSI value  */
static void (*RestoreFn)( uint32_t, bool); /* the restore function to call           */
static bool bClockSettingVolatile;         /* true, if the clock settings will be    */
                                           /* lost in Stop mode                      */

/*
 *************************************************************************************
 * MSI frequencies for the 12 MSI ranges and MSI_Range codings for the 12 MSI Ranges
 *
 *************************************************************************************/
static const uint16_t msi_range_frq_khz[] = 
{   100,   200,   400,   800, 
    1000,  2000,  4000,  8000,
    16000, 24000, 32000, 48000,
};


/******************************************************************************
 * returns true, iff the clock configuration is volatile in STOP mode
 *****************************************************************************/
bool ClockMustReconfiguredAfterStop ( void )
{
    return bClockSettingVolatile;
}

/******************************************************************************
 * Call this function to reconfigure clock after STOP mode
 *****************************************************************************/
void ClockReconfigureAfterStop(void)
{
    /* Make sure, clock setting is volatile and restoreFn is set */
    assert(bClockSettingVolatile);
    assert(RestoreFn);
    RestoreFn( saved_mhz, saved_bSwitchOffMSI );
}

#if 0
    old style wait state selection algorithm
    static uint32_t SystemClock_GetFlashLatency( uint8_t vrange, uint32_t khz )
    {  
      uint32_t flash_latency;
      switch ( vrange ) {
        case 1:
              if ( khz > 80000 ) {
                  Error_Handler(__FILE__, __LINE__); 
                  flash_latency = FLASH_LATENCY_4;
              }
              if      ( khz > 64000 ) flash_latency = FLASH_LATENCY_4;
              else if ( khz > 48000 ) flash_latency = FLASH_LATENCY_3;
              else if ( khz > 32000 ) flash_latency = FLASH_LATENCY_2;
              else if ( khz > 16000 ) flash_latency = FLASH_LATENCY_1;
              else                    flash_latency = FLASH_LATENCY_0;
            break;
        case 2:
              if ( khz > 26000 ) {
                  Error_Handler(__FILE__, __LINE__); 
                  flash_latency = FLASH_LATENCY_4;
              }
              if      ( khz > 18000 ) flash_latency = FLASH_LATENCY_3;
              else if ( khz > 12000 ) flash_latency = FLASH_LATENCY_2;
              else if ( khz > 6000  ) flash_latency = FLASH_LATENCY_1;
              else                    flash_latency = FLASH_LATENCY_0;
            break;
         default:
            Error_Handler(__FILE__, __LINE__); 
            flash_latency = FLASH_LATENCY_4;
      }

      return flash_latency;
    }
#endif


#if defined(STM32L43xx) || defined(STM32L476xx) || defined(STM32L496xx)
    /*
     *******************************************************************************
     Flash wait states in dependency of Vcore and HCLK for STM32L4 devices
     Wait states                            HCLK (MHz) 
     (WS)(LATENCY)               VCORE Range 1(1)   VCORE Range 2(2)
         0 WS (1 CPU cycles)         = 16                = 6
         1 WS (2 CPU cycles)         = 32                = 12
         2 WS (3 CPU cycles)         = 48                = 18
         3 WS (4 CPU cycles)         = 64                = 26
         4 WS (5 CPU cycles)         = 80                = 26
     maximum HCLK at Vcore Range 2 is 26 MHz!
     *******************************************************************************
     */
/* Maximum allowable HCLK for Vcore Range1 and Range2 */
/* minimum # of flash WS                    0               1                   2                   3                   4 */       
static const uint8_t hclk_range_1[]  = {16,                32,                 48,                 64,                 80, };
static const uint8_t hclk_range_2[]  = { 6,                12,                 18,                 26, };
static const uint32_t flash_latency[] = {FLASH_LATENCY_0,   FLASH_LATENCY_1,    FLASH_LATENCY_2,    FLASH_LATENCY_3,    FLASH_LATENCY_4, };
#elif defined(STM32L4PLUS_FAMILY)
    /*
     *******************************************************************************
     Flash wait states in dependency of Vcore and HCLK for STM32L4+ devices
     (WS)(LATENCY)               VCORE Range 1(1)   VCORE Range 2(2)
         0 WS (1 CPU cycles)         = 20                = 8
         1 WS (2 CPU cycles)         = 40                = 16
         2 WS (3 CPU cycles)         = 60                = 26
         3 WS (4 CPU cycles)         = 80                = 26
         4 WS (5 CPU cycles)         = 100               = 26
         5 WS (6 CPU cycles)         = 120               = 26
     maximum HCLK at Vcore Range 2 is 26 MHz!
     *******************************************************************************
     */
/* Maximum allowable HCLK for Vcore Range1 and Range2 */
/* minimum # of flash WS                    0               1                   2                   3                   4                5                   */       
static const uint8_t hclk_range_1[]  = {20,                40,                 60,                 80,                 100,             120, };
static const uint8_t hclk_range_2[]  = { 8,                16,                 26, };
static const uint8_t flash_latency[] = {FLASH_LATENCY_0,   FLASH_LATENCY_1,    FLASH_LATENCY_2,    FLASH_LATENCY_3,    FLASH_LATENCY_4, FLASH_LATENCY_5, };

#else
    #error "No Flash Waitstate table for selected MCU"
#endif

#define      MAX_LATENCY()                   flash_latency[ARRSIZE(uint32_t, flash_latency)-1];
#define      ARRSIZE(basetype,array)         (sizeof(array)/sizeof(basetype))

static const uint8_t* range_tables[] = {hclk_range_1,      hclk_range_2, };
static const uint32_t  size_tables[]  = {ARRSIZE(uint8_t, hclk_range_1),      ARRSIZE(uint8_t, hclk_range_2),  };
/*
 *******************************************************************************
 Flash wait states in dependency of Vcore and HCLK for STM32L4 devices
 (WS)(LATENCY)               VCORE Range 1(1)   VCORE Range 2(2)
     0 WS (1 CPU cycles)         = 16                = 6
     1 WS (2 CPU cycles)         = 32                = 12
     2 WS (3 CPU cycles)         = 48                = 18
     3 WS (4 CPU cycles)         = 64                = 26
     4 WS (5 CPU cycles)         = 80                = 26
 maximum HCLK at Vcore Range 2 is 26 MHz!
 *******************************************************************************
 */
static uint32_t SystemClock_GetFlashLatency( uint8_t vrange, uint8_t mhz )
{  
  const uint8_t *act_range_table;
  uint32_t act_table_size;
  uint32_t i;
 
