rainer20512/stm32-fw/stm32l4/Src/system/clockconfig.c
  /* Ensure, we have a table for the passed range */
  if ( vrange > ARRSIZE(uint32_t *, range_tables) ) {
      Error_Handler(__FILE__, __LINE__); 
      return MAX_LATENCY();
  } else {
      act_range_table = range_tables[vrange-1];
      act_table_size  = size_tables [vrange-1];
  }

  /* Find the apprpriate entry in the selected frequency table, ie that antry that is equal or higher than the desired HCLK frq */
  i = 0;
  while ( i < act_table_size && act_range_table[i] < mhz ) {
    i++;
  }

  /* Check, whether desired frq is within allowed range */
  if ( i >= act_table_size ) {
      Error_Handler(__FILE__, __LINE__); 
      return MAX_LATENCY();
   } else {
      return flash_latency[i];
   }
}

#if USE_USB > 0
    static inline __attribute__((always_inline)) void SC_SetUsbClockSource(uint32_t source )
    {
        MODIFY_REG(RCC->CCIPR, RCC_CCIPR_CLK48SEL_Msk, source );
    }
#endif


#if defined(STM32L4PLUS_FAMILY)
    /*
     *************************************************************************************************
     * @brief  Set the Vcore voltage to Vrange1, Vrange2 or VRange1 Boost
     * @param   vrange - 1,2 or 3 according to Vrange1, Vrange2 and  VRange1 Boost
     */
    static void SC_SetVrange ( uint8_t vrange )
    {
        uint32_t pwrbit = __HAL_RCC_PWR_IS_CLK_ENABLED();
        if ( !pwrbit ) __HAL_RCC_PWR_CLK_ENABLE();

        HAL_PWREx_ControlVoltageScaling( vrange == 1 ? PWR_REGULATOR_VOLTAGE_SCALE1 :  vrange == 2 ? PWR_REGULATOR_VOLTAGE_SCALE2 : PWR_REGULATOR_VOLTAGE_SCALE1_BOOST );

        /* Switch PWR domain clock off again, if it was off before */
        if ( !pwrbit ) __HAL_RCC_PWR_CLK_DISABLE();
    }
#else
    /*
     *************************************************************************************************
     * @brief  Set the Vcore voltage to Vrange1 or Vrange2
     * @param   vrange - 1or 2 according to Vrange1 and Vrange2
     */
    static void SC_SetVrange ( uint8_t vrange )
    {
        uint32_t pwrbit = __HAL_RCC_PWR_IS_CLK_ENABLED();
        if ( !pwrbit ) __HAL_RCC_PWR_CLK_ENABLE();

        HAL_PWREx_ControlVoltageScaling( vrange == 1 ? PWR_REGULATOR_VOLTAGE_SCALE1 : PWR_REGULATOR_VOLTAGE_SCALE2 );

        /* Switch PWR domain clock off again, if it was off before */
        if ( !pwrbit ) __HAL_RCC_PWR_CLK_DISABLE();
    }
#endif
/*
 *************************************************************************************************
 * @brief  System Clock Configuration on MSI-Base
 *         The system Clock is configured as follow : 
 *            System Clock source            = MSI
 *            SYSCLK(Hz)                     = 100kHz ... 48MHz, depending from range
 *            HCLK(Hz)                       = 100kHz ... 48MHz, depending from range
 *            AHB Prescaler                  = 1
 *            APB1 Prescaler                 = 1
 *            APB2 Prescaler                 = 1
 *            Flash Latency(WS)              = depending from SYSCLK
 *            Main regulator output voltage  = Range 2
 * @param range - any value between 0 .. 11 
 *            0: around 100 kHz
 *            1: around 200 kHz
 *            2: around 400 kHz
 *            3: around 800 kHz
 *            4: around 1 MHz
 *            5: around 2 MHz
 *            6: around 4 MHz
 *            7: around 8 MHz
 *            8: around 16 MHz
 *            9: around 24 MHz
 *           10: around 32 MHz NOT ALLOWED with Vrange2
 *           11: around 48 MHz NOT ALLOWED with Vrange2
 * @param vrange - 1 or 2 according to Vrange1 or Vrange2
 *
 * @retval None
 */
static void SystemClock_MSI(uint8_t range, uint8_t vrange)
{
  /* Check validity of range and vrange */  
  if ( range >= ARRSIZE(uint16_t, msi_range_frq_khz) ) {
      Error_Handler(__FILE__, __LINE__);
      return;
  }

  if ( vrange > ARRSIZE(uint8_t*, range_tables) ) {
      Error_Handler(__FILE__, __LINE__);
      return;
  }

  uint32_t frq_mhz       = msi_range_frq_khz[range]/1000;
  uint32_t flash_latency = SystemClock_GetFlashLatency( vrange, frq_mhz );
  uint32_t msi_range     = ( ((uint32_t)range) << RCC_CR_MSIRANGE_Pos ) & RCC_CR_MSIRANGE_Msk;

  /* maximum system frq with Vrange2 is 26 Mhz, check it*/
  if( vrange == 2 && frq_mhz > 26 ) {
      Error_Handler(__FILE__, __LINE__);
      return;
  }

  /* if Vrange = 1 then set it first to avoid overclocking when changing clock parameters */ 
  if ( vrange == 1 ) SC_SetVrange(vrange);

  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  
  /* Enable MSI Oscillator */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.MSIState = RCC_MSI_ON;
  RCC_OscInitStruct.MSIClockRange = msi_range;
  RCC_OscInitStruct.MSICalibrationValue=0x00;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }

  /* Select MSI as system clock source and configure the HCLK, PCLK1 and PCLK2 
     clocks dividers */
  RCC_ClkInitStruct.ClockType      = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_MSI;
  RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;  
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;  
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, flash_latency)!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }

  /* 
   * if Vrange = 2 then set it after all other clock parameters have been set 
   * to avoid overclocking
   */
  if ( vrange == 2 ) SC_SetVrange(vrange);
  
  
  /* Select MSI as WakeUp clock */
  CLEAR_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);

  #if USE_USB > 0
      /* Set USB clock also to MSI 48 MHz */
      if ( msi_range == RCC_MSIRANGE_11 ) {
          SC_SetUsbClockSource(RCC_USBCLKSOURCE_MSI);
      }
  #endif
}

/******************************************************************************
 * Switch MSI clock off
 *****************************************************************************/
static void SwitchOffMSI(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};

