rainer20512/stm32-fw/stm32l4/Src/system/clockconfig.c
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_MSI;
    RCC_OscInitStruct.MSIState = RCC_MSI_OFF;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK)
    {
      /* Initialization Error */
      while(1); 
    }
}

/* HSE --- HSE --- HSE --- HSE --- HSE --- HSE --- HSE --- HSE --- HSE --- HSE --- 
 * The following #ifdef-block requires an HSE oscillator being functional, either
 * as original crystal oscillator or being supplied as external clock
 * HSE --- HSE --- HSE --- HSE --- HSE --- HSE --- HSE --- HSE --- HSE --- HSE --*/

#if defined(HW_HAS_HSE)
    /******************************************************************************
     * Switch HSE clock on
     *****************************************************************************/
    static void SwitchOnHSE(void)
    {
      RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  
  
      /* Enable HSE Oscillator */
      RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
      #if defined(HW_HAS_HSE_CRYSTAL)
        RCC_OscInitStruct.HSEState = RCC_HSE_ON;
      #elif defined(HW_HAS_HSE_BYPASS)
        RCC_OscInitStruct.HSEState = RCC_HSE_BYPASS;
      #else
        #error "Undefined LSE oscillator type"
      #endif
      RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
      if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK)
      {
        /* Initialization Error */
        while(1); 
      }
    }
    /*
     * The initialization part that has to be restored after wakeup from stop 
     * only available, if an HSE oscillator is euqipped
     */
    static void SystemClock_HSE_Vrange2_restore ( uint32_t xxmhz, bool bSwitchOffMSI)
    {
      RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

      UNUSED(xxmhz);
      SwitchOnHSE();

      RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_SYSCLK;
      RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSE;
      HAL_RCC_ClockConfig(&RCC_ClkInitStruct, SystemClock_GetFlashLatency( 2, HSE_FREQUENCY/1000000 ));

      if ( bSwitchOffMSI ) {
        SwitchOffMSI();
      }
    }

 /*
  ************************************************************************************************************
  * @brief  System Clock Configuration on HSE crystal or HSE clock input with Vrange2
  *         The system Clock is configured as follow : 
  *            System Clock source            = HSE crystal clock or HSE bypass clock input
  *            SYSCLK(Hz)                     = depends from HSE input clock or HSE crystal resp.
  *            HCLK(Hz)                       = depends from HSE input clock or HSE crystal resp.
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 1
  *            APB2 Prescaler                 = 1
  *            Flash Latency(WS)              = set according to HSE frequency
  *            Vrange                         = 2
  * @param  bSwitchOffMSI - Set to TRUE, if MSI Clock should be switched off. When going to sleep, MSI clock
  *         MUST be activated again, BEFORE going to sleep
  * @note only available, if HSE oscillator is equipped
  * @note the HCLK frq depends from the HSE crystal frq or the HSE clock input signal in bypass mode
  *
  * @retval None
  */
  static void SystemClock_HSE_Vrange2(bool bSwitchOffMSI)
    {
      RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

      SwitchOnHSE();
      /* Select HSE as system clock source and configure the HCLK, PCLK1 and PCLK2 
         clocks dividers */
      RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
      RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSE;
      RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
      RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;  
      RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
      if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, SystemClock_GetFlashLatency(2, HSE_FREQUENCY/1000000) )!= HAL_OK)
      {
        /* Initialization Error */
        while(1); 
      }

      /* Select core voltage range 2 after all other changes to prevent overclocking */
      SC_SetVrange(2);

      /* Disable MSI Oscillator, if desired */
      if ( bSwitchOffMSI ) {
        SwitchOffMSI();
        /* HSI16 as Wakeup clock */
        SET_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);
      } else {
        /* MSI as Wakeup clock */
        CLEAR_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);
      }
    }

    /*
     * The initialization part that has to be restored after wakeup from stop 
     * only available, if an HSE oscillator is euqipped
     */
    static void SystemClock_HSE_Vrange1_restore ( uint32_t xxmhz, bool bSwitchOffMSI)
    {
      RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

      UNUSED(xxmhz);
      SwitchOnHSE();

      RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_SYSCLK;
      RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSE;
      HAL_RCC_ClockConfig(&RCC_ClkInitStruct, SystemClock_GetFlashLatency(1, HSE_FREQUENCY/1000000) );
      if ( bSwitchOffMSI ) {
        SwitchOffMSI();
      }
    }

 /*
  ************************************************************************************************************
  * @brief  System Clock Configuration on HSE crystal or HSE clock input with Vrange1
  *         The system Clock is configured as follow : 
  *            System Clock source            = HSE crystal clock or HSE bypass clock input
  *            SYSCLK(Hz)                     = depends from HSE input clock or HSE crystal resp.
  *            HCLK(Hz)                       = depends from HSE input clock or HSE crystal resp.
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 1
  *            APB2 Prescaler                 = 1
  *            Flash Latency(WS)              = set according to HSE frequency
  *            Vrange                         = 1
  * @param  bSwitchOffMSI - Set to TRUE, if MSI Clock should be switched off. When going to sleep, MSI clock
  *         MUST be activated again, BEFORE going to sleep
  * @note only available, if HSE oscillator is equipped
  * @note the HCLK frq depends from the HSE crystal frq or the HSE clock input signal in bypass mode
  *
  * @retval None
  */
    static void SystemClock_HSE_Vrange1(bool bSwitchOffMSI)
    {
      RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
 
      SwitchOnHSE();
  
