rainer20512/stm32-fw/stm32l4/Src/system/clockconfig.c
      /* Select core voltage range 1 before any other changes */
      SC_SetVrange(1);

      /* Select HSE as system clock source and configure the HCLK, PCLK1 and PCLK2 
         clocks dividers */
      RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
      RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSE;
      RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
      RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;  
      RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
      if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, SystemClock_GetFlashLatency(1, HSE_FREQUENCY/1000000) )!= HAL_OK)
      {
        /* Initialization Error */
        while(1); 
      }

      /* Disable MSI Oscillator, if desired */
      if ( bSwitchOffMSI ) {
        SwitchOffMSI();
        /* HSI16 as Wakeup clock */
        SET_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);
      } else {
        /* MSI as Wakeup clock */
        CLEAR_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);
      }
    }
#endif /* HW_HAS_HSE */


/**
  * @brief  Switch on HSI an select as system clock 
  *
  * @note Caller must assure, that core voltage and wait srtats are selected properly before!
  * 
  * allowed are - Vrange 1, min 0 flash WS
  *             - Vrange 2, min 2 flash WS
  *
  */
static void SC_SwitchOnHSI16(uint8_t vrange)
{
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};

    /* Enable HSI RC-Oscillator */
    RCC_OscInitStruct.OscillatorType        = RCC_OSCILLATORTYPE_HSI;
    RCC_OscInitStruct.HSIState              = RCC_HSI_ON;
    RCC_OscInitStruct.HSICalibrationValue   = RCC_HSICALIBRATION_DEFAULT; 
    RCC_OscInitStruct.PLL.PLLState          = RCC_PLL_NONE;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK)
    {
        /* Initialization Error */
        while(1); 
    }

    /* Select HSI as system clock source and configure the HCLK, PCLK1 and PCLK2 
     clocks dividers */
    RCC_ClkInitStruct.ClockType             = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
    RCC_ClkInitStruct.SYSCLKSource          = RCC_SYSCLKSOURCE_HSI;
    RCC_ClkInitStruct.AHBCLKDivider         = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider        = RCC_HCLK_DIV1;  
    RCC_ClkInitStruct.APB2CLKDivider        = RCC_HCLK_DIV1;
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, SystemClock_GetFlashLatency(vrange, 16))!= HAL_OK)
    {
        /* Initialization Error */
        while(1); 
    }
}

/**
  * @brief  System Clock Configuration on 16MhZ HSI with one NVM-Waitstate and PowerScale 2
  *         The system Clock is configured as follow : 
  *            System Clock source            = 16MHz HSI RC-oscillator
  *            SYSCLK(Hz)                     = 16MHz
  *            HCLK(Hz)                       = 16MhZ
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 1
  *            APB2 Prescaler                 = 1
  *            Flash Latency(WS)              = 2
  *            Main regulator output voltage  = Scale2 mode
  *
  *         Alternatively, Voltage can be switched to Scale1, after that flash can operate with 0 WS
  * 
  * @param  bSwitchOffMSI - Set to TRUE, if MSI Clock should be switched off. When going to sleep, MSI clock
  *         MUST be activated again, BEFORE going to sleep
  * @retval None
  */

static void SystemClock_HSI_16MHz(bool bSwitchOffMSI, uint8_t vrange)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  
  /* Select core voltage range 1 before any other clock changes */
  if ( vrange == 1 ) SC_SetVrange(vrange);

  SC_SwitchOnHSI16(vrange);
  
  /* Select core voltage range 2 after all other clock changes */
  if ( vrange == 2 ) SC_SetVrange(vrange);

  /* Disable MSI Oscillator, if desired */
  if ( bSwitchOffMSI ) {
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_MSI;
    RCC_OscInitStruct.MSIState = RCC_MSI_OFF;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK)
    {
      /* Initialization Error */
      while(1); 
    }
  }

  /* Select HSI16 also as WakeUp clock */
  SET_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);
}


#if USE_USB > 0
    /**************************************************************************
     * PLL clock has been set up and configured properly as system clock. 
     * For STM32L4 devices, the PLL's M-divider is set and fixed by that setup
     * Now configure PLLSAI1 as 48MHz USB Clock, start PLLSAI1 and 
     * select PLLSAI1 as USB clock source
     *************************************************************************/
    static bool SetupUSB48Clk(void)
    {
    RCC_PLLInitTypeDef PLL={0};
    /* PLLSAI1 Q output to 48 MHz */
    bool success_usb = PLL_Configure(&PLL, USB_PLL, USB_PLL_LINE, 48000) == PLL_CONFIG_OK;
    if ( !success_usb ) Error_Handler_XX(-25, __FILE__, __LINE__);

    success_usb = Pll_Set( &PLL, USB_PLL) == PLL_CONFIG_OK;
    if ( !success_usb ) Error_Handler_XX(-26, __FILE__, __LINE__);
    if ( success_usb ) success_usb = Pll_Start(USB_PLL) == PLL_CONFIG_OK;

    if ( success_usb ) SC_SetUsbClockSource(RCC_USBCLKSOURCE_PLLSAI1);
    return success_usb;
    }
#endif

/******************************************************************************
 * configure PLL on HSI16 bas to xxmhz Mhz and switch on PLL
 *****************************************************************************/
static bool SwitchOnPLL ( uint32_t xxmhz )
{
  bool success;
  uint32_t pllsrc;
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};


  /* 
   * if PLL is already selected as system clock source, 
   * it must be disabled before reconfiguration 
   */
  if (  __HAL_RCC_GET_SYSCLK_SOURCE() == RCC_CFGR_SWS_PLL ) {
    /* if so, select HSI as temporary system clock source and stop PLL in order to reconfigure it */
    /* Vrange and Wait states have been set by caller */
    SC_SwitchOnHSI16(1);
    PLL_Stop(SYSCLK_PLL);
  }

  #if USE_USB > 0
      CLEAR_BIT(RCC->CR, RCC_CR_PLLSAI1ON_Msk);
  #endif

  /* if HSE oscillator is equipped, use as PLL input, otherwise use HSI16 */
  #if defined(PLL_INP_FRQ) 
    #undef PLL_INP_FRQ
  #endif

  #if defined(HW_HAS_HSE)
    SwitchOnHSE();
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    pllsrc = RCC_PLLSOURCE_HSE;
    #define PLL_INP_FRQ  HSE_FREQUENCY
  #else
      RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
      RCC_OscInitStruct.HSIState = RCC_HSI_ON;
      RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT; 
      pllsrc = RCC_PLLSOURCE_HSI;
      #define PLL_INP_FRQ 16000000
  #endif

  /* Start PLL input clock, do not set PLL at this time */
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK) {
    /* Initialization Error */
    while(1); 
  }

  /* now handle the setup of the PLL and start it */
  RCC_OscInitStruct.PLL.PLLSource = pllsrc;
  RCC_OscInitStruct.PLL.PLLState  = RCC_PLL_ON;

  success = PLL_Configure_SYSCLK(&RCC_OscInitStruct, xxmhz*1000, PLL_INP_FRQ/1000) == PLL_CONFIG_OK;
  if ( !success ) Error_Handler_XX(-20, __FILE__, __LINE__);
    
