rainer20512/stm32-fw/stm32l4/Src/system/clockconfig.c
  success = PLL_Set( & RCC_OscInitStruct.PLL, SYSCLK_PLL) == PLL_CONFIG_OK;
  if ( !success ) Error_Handler_XX(-21, __FILE__, __LINE__);
  if ( success ) success = PLL_Start(SYSCLK_PLL) == PLL_CONFIG_OK;
    
  return success;
}

/*
 * The initialization part that has to be restored after wakeup from stop 
 */
static void SystemClock_PLL_xxMHz_Vrange1_restore (uint32_t xxmhz, bool bSwitchOffMSI)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
 
  uint32_t flash_latency = SystemClock_GetFlashLatency(1, xxmhz );

  /* Restart all previously enabled PLLs */
  PLL_Restart();

  /* Set system clock source to PLL */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_SYSCLK;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  HAL_RCC_ClockConfig(&RCC_ClkInitStruct, flash_latency );

  if ( bSwitchOffMSI ) {
    SwitchOffMSI();
  }
}
#if defined ( STM32L4PLUS_FAMILY )
    /*
     * Switch system Clock to PLL is somewhat complicated on L4+ devices:
     *
     * When Vrange1 Boost mode is selected the first time, scaling up has
     * to be done in two steps: first with HCLK divided by 2, then
     * with desired HCLK in second step
     *
     * Vice versa, if Boost mode is deselected the first time, also
     * frq decrease has also to be done in two steps: first, set
     * HCLK prescaler to 2, then disabel boost, then set desired clk frq
     */

    static void SC_Switch_to_PLL ( uint32_t xxmhz )
    {
      RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

      uint32_t flash_latency;
      uint8_t vrange = xxmhz > 80 ? 3:1;
      
      /* Activate PWR, if not already activated */
      uint32_t pwrbit = __HAL_RCC_PWR_IS_CLK_ENABLED();
      if ( !pwrbit ) __HAL_RCC_PWR_CLK_ENABLE();

      uint32_t is_boosted = ( (PWR->CR5 & PWR_CR5_R1MODE) == 0 );

      /* switch off boost mode -> first step: divide HCLK by 2 */
      if ( is_boosted && vrange == 1 ) {
          RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK;
          RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV2;
          /* We use the intermediate flash latency for 60MHz HCLK, which is always on the safe side */
          if(HAL_RCC_ClockConfig(&RCC_ClkInitStruct, SystemClock_GetFlashLatency(1, 60 )) != HAL_OK) {
            /* Initialization Error */
            while(1);
          }
      }
      
      if ( !is_boosted && vrange == 3 ) {
          /* switch to boost mode: first step: divide HCLK by 2 */
          RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV2;
          flash_latency = SystemClock_GetFlashLatency(1, xxmhz/2);
      } else {
          RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
          flash_latency = SystemClock_GetFlashLatency(1, xxmhz);
      }

      /* Select core voltage range 1 as desired */
      SC_SetVrange(vrange);

      /* configure and switch on PLL with desired frquency */
      SwitchOnPLL(xxmhz);
  
      /* 
       * Select Pll as system clock source and configure PCLK1 and PCLK2 clocks dividers,
       * the HCLK divider has been set above
       */
      RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
      RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
      // see above RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
      RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;  
      RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
      if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, flash_latency )!= HAL_OK)
      {
        /* Initialization Error */
        while(1); 
      }

      /* last step: If boost mode is enabled the first time, now set HCLK prescaler to 1 */
      if ( !is_boosted && vrange == 3 ) {  
          RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK;
          RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
          if(HAL_RCC_ClockConfig(&RCC_ClkInitStruct, SystemClock_GetFlashLatency(1, xxmhz )) != HAL_OK) {
            /* Initialization Error */
            while(1);
          }
      }

      if ( !pwrbit ) __HAL_RCC_PWR_CLK_DISABLE();
    }
#else
    /*
     * Switch system Clock to PLL is easy on L4 devices: Just switch 
     */
    static void SC_Switch_to_PLL ( uint32_t xxmhz )
    {
      RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

      uint32_t flash_latency = SystemClock_GetFlashLatency(1, xxmhz);
      uint8_t vrange = 1;

      /* Select core voltage range 1 before any other clock changes */
      SC_SetVrange(vrange);

      SwitchOnPLL(xxmhz);
  
      /* Select Pll as system clock source and configure the HCLK, PCLK1 and PCLK2 
         clocks dividers */
      RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
      RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
      RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
      RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;  
      RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
      if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, flash_latency )!= HAL_OK)
      {
        /* Initialization Error */
        while(1); 
      }
    }
#endif
/**
  * @brief  System Clock Configuration on 32MhZ PLL-Clock, basing on 16MhZ HSI
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL Clock
  *            PLL input                      = 16MHz HSI RC-oscillator
  *            SYSCLK(Hz)                     = as desired, between 16 and 80 MHz
  *            HCLK(Hz)                       = as desired, between 16 and 80 MHz
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 1
  *            APB2 Prescaler                 = 1
  *            Flash Latency(WS)              = depending from xxmhz, between 0 and 4
  *            Main regulator output voltage  = Scale1 mode
  *
  * 
  * @param  bSwitchOffMSI - Set to TRUE, if MSI Clock should be switched off. When going to sleep, MSI clock
  *         MUST be activated again, BEFORE going to sleep
  * @retval None
  */

static void SystemClock_PLL_xxMHz_Vrange1(uint32_t xxmhz, bool bSwitchOffMSI)
{ 
 
  SC_Switch_to_PLL(xxmhz);
     
  #if USE_USB > 0
    SetupUSB48Clk();
  #endif

  /* Disable MSI Oscillator, if desired */
  if ( bSwitchOffMSI ) {
    SwitchOffMSI();
  }

  /* Select HSI16 as WakeUp clock */
  SET_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);
}

static const uint16_t pll_clk_rates[] = ALLOWED_PLL_CLOCKS;
/*******************************************************************************
 * Return the clock spped in MHz for a given CLK_CONFIG_T with PLL useage
 *******************************************************************************/
static uint16_t GetPLLClockRate( CLK_CONFIG_T clk_config_byte )
{
    /* check for clk_config_byte being in the PLL range of configurations */
    if ( clk_config_byte < CLK_PLL_VRNG1_08MHZ ) return 0;

    uint8_t clk_idx = clk_config_byte - CLK_PLL_VRNG1_08MHZ;

    if ( clk_idx >= ARRSIZE(uint16_t, pll_clk_rates) ) 
        return 0; 
    else   
        return pll_clk_rates[clk_idx];
}



/* Only use "SystemClock_SetConfiguredClock" to change system clock            */
/* THis will ensure, that all devices will be noticed about clock              */
/* changes                                                                     */
/*******************************************************************************
 * Do all the clock setting on a configuration byte basis
 *******************************************************************************/
void SystemClock_Set(CLK_CONFIG_T clk_config_byte, bool bSwitchOffMSI )
{
    /* 
     * When using USB, we need a 48MHz clock. This is generated from PLLSAI1
     * in any case. So we only allow clock settings, which are derived from PLL
     * This is not mandatory, but easier to handle
     * Only if the System clock is MSI48, we use this as USB clock, too
     */
    #if USE_USB > 0
        /* 
         * any clocksetting without PLL and != MSI48 will be changed to
         * MSI48, if USB is configured.
         */
        if ( clk_config_byte < CLK_MSI_VRNG1_48MHZ ) {
            DEBUG_PRINTF("Error: Clock config #%d not allowed with USB active. Setting SYSCLK to MSI48\n", clk_config_byte); 
            clk_config_byte = CLK_MSI_VRNG1_48MHZ;
        }
    #endif
    /* Save desired settings for restoration after Stop */
    saved_bSwitchOffMSI   = bSwitchOffMSI;

