rainer20512/stm32-fw/stm32l4/Src/system/clockconfig.c
    /* 
     * Initially assume, that there is no restoration needed
     * In general, all clock settings on basis of HSI16 or MSI are non volatile
     * and do not need a restoration, whereas all other clock settings 
     * ( eg. HSE or PLL are volatile and need a restauration 
     */

    if (  clk_config_byte <= CLK_MSI_VRNG1_48MHZ ) {
        /* First, handle all clock settings, that are not PLL based */
        bClockSettingVolatile = false;         
        RestoreFn             = NULL;

        switch ( clk_config_byte ) {
            case CLK_MSI_VRNG2_02MHZ:
                SystemClock_MSI(5, 2);
                break;
            case CLK_MSI_VRNG2_04MHZ:
                SystemClock_MSI(6, 2);
                break;
            case CLK_MSI_VRNG1_08MHZ:
                SystemClock_MSI(7, 1);
                break;
            case CLK_MSI_VRNG2_08MHZ:
                SystemClock_MSI(7, 2);
                break;
            case CLK_HSE_VRNG1:
                #if defined(HW_HAS_HSE)
                    bClockSettingVolatile   = true; 
                    RestoreFn               = SystemClock_HSE_Vrange1_restore;
                    SystemClock_HSE_Vrange1(bSwitchOffMSI);
                #else
                    DEBUG_PRINTF("Clock option not avialable - No LSE oscillator equipped");
                #endif
                break;
            case CLK_HSE_VRNG2:
                #if defined(HW_HAS_HSE)
                    bClockSettingVolatile   = true;         
                    RestoreFn               = SystemClock_HSE_Vrange2_restore;
                    SystemClock_HSE_Vrange2(bSwitchOffMSI);
                #else
                    DEBUG_PRINTF("Clock option not avialable - No LSE oscillator equipped");
                #endif
                break;
            case CLK_HSI_VRNG1_16MHZ:
                SystemClock_HSI_16MHz(bSwitchOffMSI, 1);
                break;
            case CLK_HSI_VRNG2_16MHZ:
                SystemClock_HSI_16MHz(bSwitchOffMSI, 2);
                break;
            case CLK_MSI_VRNG1_16MHZ:
                SystemClock_MSI(8, 1);
                break;
            case CLK_MSI_VRNG2_16MHZ:
                SystemClock_MSI(8, 2);
                break;
            case CLK_MSI_VRNG1_24MHZ:
                SystemClock_MSI(9,1);
                break;
            case CLK_MSI_VRNG2_24MHZ:
                SystemClock_MSI(9,2);
                break;
            case CLK_MSI_VRNG1_32MHZ:
                SystemClock_MSI(10, 1);
                break;
            case CLK_MSI_VRNG1_48MHZ:
                SystemClock_MSI(11, 1);
                break;
            default:
                DEBUG_PRINTF("Error: Clockconfig - Unknown config #%d\n", clk_config_byte);       
        } // switch
    } else {
        /* 
         * Thereafter, handle all PLL-based clock settings: All these clock settings are
         * volatile and require a restore function after wakeup from stop
         */
        bClockSettingVolatile = true;         
        RestoreFn             = SystemClock_PLL_xxMHz_Vrange1_restore;
        saved_mhz             = GetPLLClockRate(clk_config_byte );
        if ( saved_mhz == 0 ) { 
            DEBUG_PRINTF("Error: Clockconfig - Unknown config #%d, setting 48Mhz PLL clk\n", clk_config_byte);       
            saved_mhz = 48;
        }                
        SystemClock_PLL_xxMHz_Vrange1(saved_mhz, bSwitchOffMSI);
    } // if

    /* Notice all devices about frequency change                             */
    /* Momentarily, the frq change is not reverted, if any device refuses to */
    /* change frq. this has to be changed for correct implementation         */
    /* Eg by asking before frq change takes place                            */
    if ( DevicesInhibitFrqChange() ) {
        #if DEBUG_MODE > 0
            DEBUG_PUTS("ERR: One or more devices did not agree to new frequency!");
        #endif
    }

    #if DEBUG_MODE > 0
        DEBUG_PRINTF("SYSCLK nom. %d\n", HAL_RCC_GetSysClockFreq());
        DEBUG_PRINTF("SYSCLK real  %d\n",Get_SysClockFrequency());
    #endif
}

/*
 *****************************************************************************
 * Set the system clock configuration as configured in config-variable
 *****************************************************************************/
void SystemClock_SetConfiguredClock(void)
{
  // Set clcock configuration, switch MSI off, if no more used
  SystemClock_Set(config.clk_config, true );
}

/*
 *****************************************************************************
 * Configure LSE clock
 *****************************************************************************/
void LSEClockConfig(bool bLSEon, bool bUseAsRTCClock)
{
  RCC_OscInitTypeDef        RCC_OscInitStruct;
  RCC_PeriphCLKInitTypeDef  PeriphClkInitStruct;
  
  /* Enable the PWR Clock and Enable access to the backup domain */
  __HAL_RCC_PWR_CLK_ENABLE();
  HAL_PWR_EnableBkUpAccess();

  /*Switch LSE on or OFF */
  RCC_OscInitStruct.OscillatorType =  RCC_OSCILLATORTYPE_LSE;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.LSEState = bLSEon ? RCC_LSE_ON : RCC_LSE_OFF;
  if(HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
      Error_Handler(__FILE__, __LINE__);
  
  /* Set to lowest driving strngth */
  __HAL_RCC_LSEDRIVE_CONFIG(RCC_LSEDRIVE_LOW);
 
  /* Set LSE as RTC clock source, if desired */
  if ( bUseAsRTCClock )  {
      PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_RTC;
      PeriphClkInitStruct.RTCClockSelection = RCC_RTCCLKSOURCE_LSE;
      if(HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
          Error_Handler(__FILE__, __LINE__);
  }

  /* IF MSI is running, set the MSIPLL bit for automatic synchronization of MSI to LSE clock */
  if ( RCC->CR & RCC_CR_MSION ) {
    SET_BIT(RCC->CR, RCC_CR_MSIPLLEN );
  }
   
  /*Disable Backup Access and PWR Clock */ 
  HAL_PWR_DisableBkUpAccess();
  __HAL_RCC_PWR_CLK_DISABLE(); 
}

/*
 *****************************************************************************
 * Configure HSI clock
 *****************************************************************************/
void HSIClockConfig(bool bHSIon)
{
  RCC_OscInitTypeDef        RCC_OscInitStruct;
  
  /*Switch HSI on or OFF */
  RCC_OscInitStruct.OscillatorType =  RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
   RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;            /* Reset value */
  RCC_OscInitStruct.HSIState = bHSIon ? RCC_HSI_ON : RCC_HSI_OFF;
  if(HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
      Error_Handler(__FILE__, __LINE__);
  
  /* Set HSI Autostart from Stop mode */
  RCC->CR |= RCC_CR_HSIASFS;
}


